Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/codeberg-tblock.tmx
Source language: en
Languages: sv

source: Restart wizard
sv: Starta om guiden

source: {0} filter list(s) enabled and {1} active rule(s)
sv: Aktiva filterlistor: {0}; aktiva regler: {1}

source: Click on a filter list from the table to view its details.
sv: Klicka på en filterlista i tabellen för att visa dess information.

source: You can now press Close to close this dialog.
sv: Du kan nu trycka på Stäng för att stänga dialogrutan.

source: Automatic updates
sv: Automatiska uppdateringar

source: Hosts file format
sv: Hosts-filformat

source: No update available
sv: Ingen uppdatering tillgänglig

source: Balanced
sv: Balanserad

source: This is a custom filter list that was manually added by the user.
sv: Detta är en anpassad filterlista som användaren har lagt till manuellt.

source: Please choose a file
sv: Välj en fil

source: Please specify a title to give to your custom filter list.
sv: Ange en titel för den anpassade filterlistan.

source: Systemwide ads/trackers blocker
sv: Systemomfattande blockerare av annonser och spårare

source: unlocked
sv: upplåst

source: Import your /etc/hosts rules into TBlock. This format is fully supported.
sv: Importera regler från /etc/hosts till TBlock. Det här formatet stöds fullt ut.

source: Update all
sv: Uppdatera alla

source: Unlock database
sv: Lås upp databasen

source: Save
sv: Spara

source: Adding custom filter list: {}
sv: Lägger till anpassad filterlista: {}

source: Block malicious websites
sv: Blockera skadliga webbplatser

source: Failed to subscribe to: {}
sv: Kunde inte prenumerera på: {}

source: enabled
sv: aktiverad

source: Use beta channel for updates
sv: Använd betakanalen för uppdateringar

source: Redirect
sv: Omdirigera

source: More information here
sv: Mer information här

source: Enter the URL of the custom filter list you want to add:
sv: Ange webbadressen till den anpassade filterlista som du vill lägga till:

source: Failed to disable protection.
sv: Kunde inte inaktivera skyddet.

source: A profile that will let you configure everything yourself.
sv: En profil som låter dig konfigurera allt själv.

source: Add rule
sv: Lägg till regel

source: Next
sv: Nästa

source: Removing from cache: {}
sv: Tar bort från cachen: {}

source: Please provide a valid URL/local file.
sv: Ange en giltig URL eller lokal fil.

source: The database is locked. Please try again later. If this error persists, you can unlock the database in the navigation menu under TBlock > Troubleshooting.
sv: Databasen är låst. Försök igen senare. Om felet kvarstår kan du låsa upp databasen i navigeringsmenyn under TBlock > Felsökning.

source: Enter domain:
sv: Ange domän:

source: This efficient profile is the perfect solution for regular users.
sv: Denna effektiva profil är den perfekta lösningen för den genomsnittlige användaren.

source: This profile is light, but some ads and trackers won't be blocked.
sv: Den här profilen är lätt, men vissa annonser och spårare blockeras inte.

source: Policy
sv: Åtgärd

source: Cancel
sv: Avbryt

source: Failed to download: {}
sv: Kunde inte hämta: {}

source: Failed to update rules from: {}
sv: Kunde inte uppdatera regler från: {}

source: Enable protection to show statistics
sv: Slå på skydd för att visa statistik

source: no database
sv: ingen databas

source: Block gambling websites
sv: Blockera spelsajter

source: Add custom
sv: Lägg till anpassad

source: Updates
sv: Uppdateringar

source: TBlock is an open source content blocker. It can block ads and trackers, as well as harmful websites. The blocking is system-wide, which means that your whole system is protected. TBlock won't be able to block specific elements on a page. It is no replacement for an antivirus software. However, it will be able to block ads and trackers in all the apps that you use on your machine.
sv: TBlock är en innehållsblockerare med öppen källkod. Den kan blockera annonser, spårare och skadliga webbplatser. Blockeringen gäller hela systemet, vilket innebär att hela systemet skyddas. TBlock kan inte blockera enskilda element på en sida och ersätter inte ett antivirusprogram. Däremot kan den blockera annonser och spårare i alla program som används på datorn.

source: Homepage
sv: Hemsida

source: An anti-capitalist ad blocker that uses the hosts file
sv: En annonsblockerare med antikapitalistisk inriktning som använder Hosts-filen

source: Troubleshooting
sv: Felsökning

source: Failed to enable protection and to build new hosts file.
sv: Kunde inte aktivera skyddet och skapa en ny Hosts-fil.

source: Building hosts file
sv: Skapar Hosts-fil

source: TBlock format v1 (legacy)
sv: TBlock format v1 (arv)

source: Initial configuration
sv: Första inställning

source: Block websites that spread fake news
sv: Blockera webbplatser som sprider falska nyheter

source: Block
sv: Blockera

source: Enable
sv: Slå på

source: Enter the ID to give to your custom filter list:
sv: Ange det ID som den anpassade filterlistan ska få:

source: Plain text domain list
sv: Domänlista i klartext

source: An unknown error occurred. Code: {}
sv: Ett okänt fel inträffade. Kod: {}

source: Delete
sv: Ta bort

source: Removing allowed matches
sv: Tar bort tillåtna träffar

source: Database status
sv: Databasstatus

source: Choose this if you are not sure. Note that it may take more time than usual.
sv: Välj detta om du inte är säker. Notera att det kan ta längre tid än vanligt.

source: Block hate speech and far right content
sv: Blockera hatpropaganda och högerextremt innehåll

source: Failed to extract icon pack.
sv: Kunde inte packa upp ikonpaketet.

source: Back
sv: Tillbaka

source: Let's get started
sv: Kom i gång

source: Failed to change GUI settings.
sv: Kunde inte ändra GUI-inställningarna.

source: This may take a few minutes, depending on the components you decided to block. Do not close this window until the task is finished.
sv: Detta kan ta några minuter beroende på vilka komponenter du har valt att blockera. Stäng inte fönstret förrän uppgiften är klar.

source: Protection is inactive
sv: Skydd är inaktivt

source: Please specify a valid IP address.
sv: Ange en giltig IP-adress.

source: Please be patient. It is important that you do not close this window until the task is finished.
sv: Ha tålamod. Stäng inte fönstret förrän uppgiften är klar.

source: Repair
sv: Reparera

source: Sync index
sv: Synkronisera index

source: Block websites related to addictive substances
sv: Blockera webbplatser kopplade till beroendeframkallande substanser

source: The database is already unlocked.
sv: Databasen är redan upplåst.

source: No filter list selected
sv: Ingen filterlista vald

source: Downloading icon pack
sv: Hämtar ikonpaket

source: Updating: {}
sv: Uppdaterar: {}

source: Confirm
sv: Bekräfta

source: TBlock needs to modify the system to perform this operation
sv: TBlock måste ändra systemet för att utföra åtgärden

source: Manage filter lists
sv: Hantera filterlistor

source: Operation finished successfully.
sv: Åtgärden slutfördes.

source: Refresh
sv: Uppdatera

source: Operation is running
sv: Åtgärden körs

source: None
sv: Ingen

source: IP address
sv: IP-adress

source: New
sv: Ny

source: disabled
sv: inaktiverad

source: Failed to redirect domain: {}
sv: Kunde inte omdirigera domänen: {}

source: Domain
sv: Domän

source: Title
sv: Titel

source: Ads and trackers settings
sv: Inställningar för annonser och spårare

source: Go back
sv: Gå tillbaka

source: TBlock executable was not found. Please install it and then retry.
sv: TBlock-programmet hittades inte. Installera det och försök sedan igen.

source: Everything is being set up
sv: Allt konfigureras

source: Failed to unsubscribe from: {}
sv: Kunde inte avsluta prenumerationen på: {}

source: Creating database
sv: Skapar databas

source: Check for updates at startup
sv: Sök efter uppdateringar vid start

source: dnsmasq configuration
sv: dnsmasq-konfiguration

source: Storage used
sv: Använt lagringsutrymme

source: Specify the format of your custom filter list:
sv: Ange formatet för den anpassade filterlistan:

source: Welcome to TBlock!
sv: Välkommen till TBlock!

source: Extracting icon pack
sv: Packar upp ikonpaketet

source: An update is available!
sv: En uppdatering är tillgänglig!

source: Failed to download icon pack.
sv: Kunde inte hämta ikonpaketet.

source: File must be owned by root.
sv: Filen måste ägas av root.

source: A simple list of domains to block. TBlock has native support for it.
sv: En enkel lista över domäner som ska blockeras. TBlock har inbyggt stöd för den.

source: Source already exists.
sv: Källan existerar redan.

source: Retrieving: {}
sv: Hämtar: {}

source: Active
sv: Aktiv

source: Enable GUI logs
sv: Aktivera GUI-loggar

source: Select the profile that suits your needs the best:
sv: Välj den profil som passar dina behov bäst:

source: Show more
sv: Visa mer

source: Logging
sv: Loggning

source: Nothing to do.
sv: Inget att göra.

source: Operation finished with {} error(s).
sv: Åtgärden slutfördes med {} fel.

source: Failed to add custom filter list: {}.
sv: Kunde inte lägga till anpassad filterlista: {}.

source: Safety and wellbeing settings
sv: Inställningar för säkerhet och välbefinnande

source: TBlock is currently not supported on your operating system
sv: TBlock stöds för tillfället inte av ditt operativsystem

source: Edit rules
sv: Redigera regler

source: Protection is active
sv: Skydd är aktivt

source: Failed to build hosts file.
sv: Kunde inte skapa Hosts-filen.

source: Subscribing to: {}
sv: Prenumererar på: {}

source: How to enable automatic updates?
sv: Hur aktiverar jag automatiska uppdateringar?

source: Warning
sv: Varning

source: Allow
sv: Tillåt

source: Light
sv: Lätt

source: The official format that is fully supported by TBlock.
sv: Det officiella formatet som stöds fullt ut av TBlock.

source: Aggressive
sv: Aggressiv

source: Unsubscribing from: {}
sv: Avslutar prenumeration på: {}

source: Select
sv: Välj

source: Block illegal websites (piracy)
sv: Blockera olagliga webbplatser (piratkopiering)

source: Settings
sv: Inställningar

source: A powerful profile that may however break some web pages.
sv: En kraftfull profil som dock kan göra att vissa webbsidor slutar fungera.

source: Your secure network may not be safe anymore
sv: Ditt säkra nätverk är kanske inte längre säkert

source: This includes domains that serve malware, as well as websites associated with spam, scam, phishing or ransomware activity.
sv: Detta omfattar domäner som sprider skadlig programvara samt webbplatser som är kopplade till skräppost, bedrägerier, nätfiske eller utpressningsprogram.

source: Failed to sync filter list repository index.
sv: Kunde inte synkronisera filterlistans förrådsindex.

source: Failed to block domain: {}
sv: Kunde inte blockera domänen: {}

source: Any files
sv: Alla filer

source: IP address:
sv: IP-adress:

source: Failed to unlock database.
sv: Kunde inte låsa upp databasen.

source: Failed to allow domain: {}
sv: Kunde inte tillåta domänen: {}

source: locked
sv: låst

source: Threat detected
sv: Hot upptäckt

source: This operation requires admin privileges.
sv: Denna funktion kräver administratörsprivilegier.

source: Or select a local file:
sv: Eller välj en lokal fil:

source: Close
sv: Stäng

source: Auto-detect
sv: Detektera automatiskt

source: Finish
sv: Slutför

source: Failed to delete rules
sv: Kunde inte ta bort regler

source: Unlocking the database can cause errors if another instance of TBlock is currently using the database.
sv: Upplåsning av databasen kan orsaka fel om en annan instans av TBlock använder databasen.

source: Failed to create database
sv: Kunde inte skapa databasen

source: Block pornographic websites
sv: Blockera pornografiska webbplatser

source: Syncing filter list repository index
sv: Synkroniserar filterlistornas förrådsindex

source: An Error Occurred
sv: Ett fel inträffade

source: Text files
sv: Textfiler

source: About TBlock GUI
sv: Om TBlock GUI

source: Please specify a valid domain
sv: Ange en giltig domän

source: This feature is not yet supported.
sv: Den här funktionen stöds inte ännu.

source: Failed to apply allowing rules.
sv: Kunde inte tillämpa tillåtelseregler.

source: Authentication is required to use TBlock
sv: Autentisering krävs för att använda TBlock

source: Now, let's take a few minutes to configure TBlock for the first time. Since we need to download the list of websites to block, please ensure that you have a working internet connection. When you are ready, click Next to launch the automatic setup.
sv: Nu ska vi ta några minuter för att konfigurera TBlock första gången. Eftersom listan över webbplatser som ska blockeras måste hämtas behöver du ha en fungerande internetanslutning. När du är klar klickar du på Nästa för att starta den automatiska konfigurationen.

source: Add custom filter list
sv: Lägg till anpassad filterlista

source: Import your dnsmasq.conf rules into TBlock. This format is partially supported.
sv: Importera regler från dnsmasq.conf till TBlock. Det här formatet stöds endast delvis.

source: This format is deprecated and support will be removed in future versions.
sv: Detta format är utfasat och stödet kommer tas bort i en framtida version.

source: The default format used in most browser add-ons. TBlock supports it partially only.
sv: Standardformatet som används i de flesta webbläsartillägg. TBlock har endast delvis stöd för det.

source: About TBlock
sv: Om TBlock

source: Disable
sv: Slå av

source: Security settings
sv: Säkerhetsinställningar

source: Quit
sv: Avsluta
